app/controllers/users_controller.rb

UPDATE "users" SET "about" = $1, "avatar" = $2, "location" = $3, "phone_number" = $4, "updated_at" = $5 WHERE "users"."id" = $6  [["about", ""], ["avatar", "dennis.jpg"], ["location", ""], ["phone_number", ""], ["updated_at", 2017-06-10 13:17:46 UTC], ["id", 1]]
---
  def update
    if @user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_user
    @user = User.friendly.find_by(slug: params[:id]) || User.find_by(id: params[:id])